alplabai/gd32-bridge-firmware/hal/gd32/init.c
	/* DAC bring-up.  Two channels per `dac_channels[]`:
     *   ch0 -> DAC0_OUT0 -> PA4
     *   ch1 -> DAC1_OUT0 -> PA6
     * Configure both pads as analog (GPIOA clock was enabled
     * above for the IO pad map), enable each DAC peripheral in
     * NORMAL_PIN_BUFFON mode so the output drives the pad
     * through the chip's built-in buffer. */
	gpio_mode_set(GPIOA, GPIO_MODE_ANALOG, GPIO_PUPD_NONE, GPIO_PIN_4 | GPIO_PIN_6);
	rcu_periph_clock_enable(RCU_DAC0);
	rcu_periph_clock_enable(RCU_DAC1);
	for (size_t i = 0; i < DAC_CHANNEL_COUNT; ++i) {
		dac_deinit(dac_channels[i].periph);
		dac_trigger_disable(dac_channels[i].periph, dac_channels[i].out);
		dac_wave_mode_config(dac_channels[i].periph, dac_channels[i].out, DAC_WAVE_DISABLE);
		dac_mode_config(dac_channels[i].periph, dac_channels[i].out, NORMAL_PIN_BUFFON);
		dac_enable(dac_channels[i].periph, dac_channels[i].out);
	}

	/* Free-running counter: enable the Cortex-M33 DWT cycle counter.
     * TRCENA in CoreDebug->DEMCR gates the entire DWT/ITM trace block;
     * setting CYCCNTENA in DWT->CTRL starts the 32-bit free-running
     * counter at the core clock rate (216 MHz on the GD32G553 in the
     * stock clock config -> ~19.9 s wrap, ~4.63 ns LSB).  The counter
     * is the source for bridge_hw_counter_read(). */
	CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
	DWT->CYCCNT = 0u;
	DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;

	/* PWM bring-up: configure the 8 PWM pads as alt-function outputs,
     * enable TIMER0 + TIMER7 clocks, run the per-timer + per-channel
     * init.  After this the timers are running at 1 us tick with 0%
     * duty on every channel; bridge_hw_pwm_set programs both the
     * channel compare register and the timer ARR per call. */
	for (size_t i = 0; i < PWM_CHANNEL_COUNT; ++i) {
		const gd32_pwm_ch_t *ch = &pwm_channels[i];
		gpio_mode_set(ch->gpio_port, GPIO_MODE_AF, GPIO_PUPD_NONE, ch->gpio_pin);
		gpio_output_options_set(ch->gpio_port, GPIO_OTYPE_PP, GPIO_OSPEED_12MHZ, ch->gpio_pin);
		gpio_af_set(ch->gpio_port, ch->gpio_af, ch->gpio_pin);
	}
	rcu_periph_clock_enable(RCU_TIMER0);
	rcu_periph_clock_enable(RCU_TIMER7);
	pwm_timer_init(TIMER0);
	pwm_timer_init(TIMER7);
	for (size_t i = 0; i < PWM_CHANNEL_COUNT; ++i) {
		pwm_channel_init(&pwm_channels[i]);
	}

	/* Analog REFERENCE bring-up -- MUST precede any ADC/DAC use.
     *
     * v0.2.8..this commit drove the on-chip VREF buffer at its 2.048 V
     * target (VREFEN=1, HIPM=0, VREFS[1:0]=00) on the strength of a
     * DAC->ADC copper-loopback bench check.  That is out of spec:
     * Datasheet Rev2.0 p.109 Table 4-3, VDDA row, condition "VREFBUF
     * used", requires VDDA >= VREFP+0.3 -- at the 2.048 V target that
     * is VDDA >= 2.348 V, and the V2N's analog rail is 1.8 V (the same
     * maintainer-confirmed figure ADC_VREF_MV / DAC_VREF_MV assume,
     * gd32_common.h).  The buffer cannot regulate above its own supply,
     * so VREFP settled at an UNSPECIFIED voltage -- neither 1.8 V nor
     * 2.048 V -- and the loopback's ratiometric cancellation hid
     * exactly that (alp-sdk-internal gd32-bridge-firmware#59).
     *
     * Fix: leave VREF_CS at its POR value, 0x0000 0002 (VREFEN=0,
     * HIPM=1 -- external voltage reference mode, User Manual Rev1.2
     * p.520 Table 20-1).  Table 4-3's VREFBUF-used VDDA floor does not
     * apply when the buffer is off; the applicable row (ADC used,
     * fADCMAX <= 50 MHz) only requires VDDA >= 1.71 V, which the 1.8 V
     * rail clears.  DO NOT write VREFEN=0 with HIPM=0 to "simplify"
     * this further -- that is Table 20-1's FIRST row, "VREF disabled,
     * VREFP pin pulled-down to VSSA", which grounds the node and is
     * strictly worse than either state above.  Just don't touch
     * VREF_CS at all and the reset value holds.
     *
     * VREFRDY has no documented meaning outside internal voltage-
     * reference mode (User Manual Rev1.2 p.520: the wait-for-VREFRDY
     * sentence is scoped to "VREF is configured in internal voltage
     * reference mode"), so there is nothing left for this firmware to
     * poll -- vref_ready_check() (vref.c) no longer waits on it.
     *
     * Open hardware question, NOT resolved by this change: whether
     * VREFP is board-tied to VDDA on this SoM revision, which is what
     * ADC_VREF_MV / DAC_VREF_MV assume in external-reference mode.
     * That needs a meter on the VREFP ball (J6) -- see the PR's bench
     * validation section. */

	/* ADC bring-up: configure 8 pads as analog, enable all four ADC
     * peripheral clocks, run the per-peripheral init.  adc_periph_init's
     * self-calibration runs against whatever VREFP is at this point --
     * the VREF block above intentionally leaves VREF_CS at its reset
     * value rather than driving it (#59), so this calibration is only
     * as meaningful as the still-open VREFP-vs-VDDA board question. */
	for (size_t i = 0; i < ADC_CHANNEL_MAP_COUNT; ++i) {
		gpio_mode_set(adc_channels_map[i].gpio_port,
		              GPIO_MODE_ANALOG,
		              GPIO_PUPD_NONE,
		              adc_channels_map[i].gpio_pin);
	}
	rcu_periph_clock_enable(RCU_ADC0);
	rcu_periph_clock_enable(RCU_ADC1);
	rcu_periph_clock_enable(RCU_ADC2);
	rcu_periph_clock_enable(RCU_ADC3);
	/* Boot-time calibration result intentionally not latched: a
     * converter that fails here is also the converter every request-
     * path op re-times against (the read path's bounded EOC wait +
     * self-heal), so the failure surfaces loudly on first use instead
     * of wedging boot. */
	(void)adc_periph_init(ADC0);
	(void)adc_periph_init(ADC1);
	(void)adc_periph_init(ADC2);
	(void)adc_periph_init(ADC3);
	for (size_t i = 0; i < ADC_CHANNEL_MAP_COUNT; ++i) {
		adc_sample_cycles_cache[i]    = ADC_DEFAULT_SAMPLE_CYCLES;
		adc_resolution_bits_cache[i]  = ADC_RES_BITS_DEFAULT;
		adc_oversample_ratio_cache[i] = 1u; /* no oversampling */
	}

	/* Quadrature encoder bring-up: TIMER1..4 host the four E1M
     * encoder pairs.  Each timer uses its CH0 + CH1 input-capture
     * units as the X / Y quadrature inputs (decoder mode 2 -> X4). */
	rcu_periph_clock_enable(RCU_TIMER1);
	rcu_periph_clock_enable(RCU_TIMER2);
	rcu_periph_clock_enable(RCU_TIMER3);
	rcu_periph_clock_enable(RCU_TIMER4);
	for (size_t i = 0; i < QENC_CHANNEL_COUNT; ++i) {
		qenc_channel_init(&qenc_map[i]);
	}
}

/* Called at base level after every main-loop wake.  This backend uses the
 * hook to advance work deliberately kept out of the transport ISRs.  The
 * DA9292 fault nets still reach only the Renesas, so no PMIC sampling is
 * performed here and bridge_hw_da9292_status_cached() retains its 0xFF
 * "no sample" sentinel. */
/* Base-level DSP pump (#496): drains each bound FIR/IIR stream's raw
 * samples through the FAC into its processed ring.  Runs here, off the
 * main loop -- never in the CS-EXTI stream_read path. */
extern void bridge_hw_dsp_pump(void);
/* Background OTA slot-erase pump (#770): advances a BEGIN-armed erase one
 * page-region per tick so BEGIN never blocks the SPI reply inline.  No-op
 * in the OTA-inert build. */
extern void ota_erase_tick(void);

